<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><head><title>Om LAML fotofremvisning</title> <meta name="Generator" content="LAML" /></head> <body bgcolor="#000000" text="#ffffff" link="#ffffff" vlink="#ffffff"><table border="0px" cellpadding="0" cellspacing="0" width="100%"><tbody><tr><td width="33%" align="left" valign="top"><font size="2"><a href="../index.html"><font size="2">Index</font></a></font></td> <td width="34%" align="center" valign="top"><font size="2"></font></td> <td width="33%" align="right" valign="top"><font size="2"><a href="help-en.html" class="menu-item">Help</a> &nbsp; &nbsp; &nbsp; <a href="../../index.html">Home</a></font></td></tr></tbody></table> <h1>Om LAML foto fremvisning</h1> <div><p>Dette foto show er produceret af et program kaldet <b>LAML fotogeneratoren</b>, som er designet og programmeret af Kurt N&#248;rmark, Aalborg Universitet. Programmet genererer en r&#230;kke HTML filer omkring en m&#230;ngde foto filer. Hermed kan fotografierne vises bekvemt i enhver Internet browser.</p> <p>Beskrivelsen af fremvisningens egenskaber er lavet i XML, mere pr&#230;cist i et format der kaldes <a href="http://www.cs.auc.dk/~normark/scheme/tutorial/xml-in-laml/xml-in-laml.html">XML-in-LAML</a>.</p> <p><a href="http://www.w3.org/XML/">XML</a> er en standard for beskrivelse af strukturerede data.</p> <p><a href="http://www.cs.auc.dk/~normark/laml/">LAML</a> er en softwarepakke som underst&#248;tter XML, herunder HTML, i programmeringssproget <a href="http://www.schemers.org">Scheme</a> (et sprog i Lisp familien). Mere specifikt underst&#248;tter LAML muligheden for at generere et <em>spejl</em> af et vilk&#229;rlig XML sprog for hvilket der findes en Document Type Definition (DTD). LAML har v&#230;ret anvendt i mange forskellige sammenh&#230;nge, prim&#230;rt inden for produktion af forskellige <a href="http://www.cs.auc.dk/~normark/leno/">undervisningsmaterialer</a> og  <a href="http://www.cs.auc.dk/~normark/elucidative-programming/index.html">programdokumentationsv&#230;rkt&#248;j</a>.  LAML har v&#230;ret under udvikling siden 1999.</p> <p>LAML er frit software tilg&#230;ngelig fra <a href="http://www.cs.auc.dk/~normark/laml/">LAML hjemmesiden</a>. LAML beror p&#229; en Scheme processor (typisk, men ikke n&#248;dvendigvis <a href="http://www.plt-scheme.org/">PLT</a>&#39;s <a href="http://www.plt-scheme.org/software/mzscheme/">MzScheme</a> ). Det anbefales, at processeringen af et LAML dokument aktiveres fra <a href="http://www.gnu.org/software/emacs/emacs.html">Emacs</a>. De fleste Scheme systemer samt Emacs er ligeledes frit software.</p> <p>Hvis du &#248;nsker at generere en LAML fotofremvisning kan du l&#230;se om dette p&#229; en separat <a href="http://www.cs.auc.dk/~normark/scheme/styles/xml-in-laml/photo-show/man/photo-show.html">manual side</a>.</p> <p>Hvis du er bruger af et s&#230;t fotos, genereret med systemet, kan du l&#230;se om navigation mv. p&#229; <a href="help-dk.html">hj&#230;lpe siden</a>.</p> &nbsp; <p></p> <p>Kurt N&#248;rmark <br /> <a href="http://www.cs.auc.dk/~normark/">http://www.cs.auc.dk/~normark/</a> <br /> normark@cs.aau.dk</p></div></body></html>