<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html><head><title>Hj&#230;lp om LAML foto fremvisning</title> <meta name="Generator" content="LAML" /></head> <body bgcolor="#000000" text="#ffffff" link="#ffffff" vlink="#ffffff"><table border="0px" cellpadding="0" cellspacing="0" width="100%"><tbody><tr><td width="33%" align="left" valign="top"><font size="2"><a href="../index.html"><font size="2">Index</font></a></font></td> <td width="34%" align="center" valign="top"><font size="2"></font></td> <td width="33%" align="right" valign="top"><font size="2"><a href="about-en.html" class="menu-item">About</a> &nbsp; &nbsp; &nbsp; <a href="../../index.html">Home</a></font></td></tr></tbody></table> <h1>Hj&#230;lp til LAML foto fremvisning</h1> <div><p>Denne fotofremvisning er genereret af et program, som kaldes &#39;LAML fotogeneratoren&#39;. Kort fortalt vil dette program generere en m&#230;ngde HTML filer, som tillader dig at se dine fotos i enhver Internet browser.</p> <p>Hjemmesiden giver et overblik over alle fotosider, som er processeret med LAML fotogeneratoren.</p> <p>Film indholdssiden giver et overblik over alle billeder i en enkelt &#39;film&#39;. Dette inkluderer links til de enkelt billeder og &#39;n x n&#39; links to oversigtssider med typisk 4, 9 eller 16 billeder.</p> <p>En n x n side med typisk 4, 9 eller 16 fotos viser en tabel af billeder, som er nyttigt for at danne sig en oversigt over billederne i en film.</p> <p>Vi vil her beskrive, hvordan du kan navigere i dine billeder</p> <ul><li style="margin-bottom:7pt;">Fra foto hjemmesiden man v&#230;lge en vilk&#229;rlig film. Tasterne 1-9 og a-m v&#230;lger en af filmene fra toppen af listen. &#39;x&#39;, &#39;y&#39; og &#39;z&#39; v&#230;lger de tre film fra bunden af listen. </li> <li style="margin-bottom:7pt;">Fra en film indholdsside kan man direkte v&#230;lge et vilk&#229;rligt billede med musen. Man kan ogs&#229; v&#230;lge en n x n oversigt. Tasterne 1-9 og a-m v&#230;lger en n x n side. Tasten &#39;x&#39; v&#230;lger det f&#248;rste billede, og &#39;y&#39; v&#230;lger det sidste billede. Film indholdssiderne kan v&#230;re k&#230;det sammen med links, som kan navigeres med &#39;n&#39; og &#39;p&#39;. Tasten &#39;u&#39; navigerer til foto hjemmesiden. </li> <li style="margin-bottom:7pt;">Fra en n x n oversigtsside kan man v&#230;lge en af billederne for visning i fuld st&#248;rrelse. Man kan ogs&#229; navigere frem og tilbage mellem oversigtsider, samt op til film indholdssiden. Dette g&#248;res via tastaturet med hhv. &#39;n&#39;, &#39;p&#39;, og &#39;u&#39;. Hvis filmene er forbundet, kan man endvidere skifte til n&#230;ste og foreg&#229;ende film fra hhv. sidste og f&#248;rste n x n oversigstside (igen med &#39;n&#39; og &#39;p&#39;). Hvis man v&#230;lger navnet p&#229; et billede bringes man til en side med LAML foto fragmenter, som er nyttig hvis man &#248;nsker at billedet skal indg&#229; i et andet &#39;album&#39;.</li> <li style="margin-bottom:7pt;">Fra en billedside uden automatisk skift kan man navigere til n&#230;ste og foreg&#229;ende side samt til film indholdssiden og foto hjemmesiden&#39;. Tasterne &#39;n&#39; og &#39;p&#39; g&#229;r frem og tilbage. Tasten &#39;u&#39; navigerer til den relevante n x n side. Tasten &#39;x&#39; navigerer til foto indholdssiden. Man kan ogs&#229; v&#230;lge at igangs&#230;tte automatisk skift fra side til side med &#39;K&#248;r&#39;, eller via tasten &#39;r&#39;. Hvis man v&#230;lger navnet p&#229; et billede (i &#248;verste linie p&#229; sk&#230;rmen) bringes man til en side med LAML foto fragmenter, som er nyttig hvis man &#248;nsker at billedet skal indg&#229; i et andet &#39;album&#39;. </li> <li style="margin-bottom:7pt;">Fra en billedside med automatisk skift kan man v&#230;lge at stoppe med &#39;Stop&#39; samt at g&#229; til indholdssiden eller hjemmesiden. Tasten &#39;s&#39; betyder &#39;stop&#39;.</li></ul> <p>F&#248;lgende giver en oversigt over tasturgenveje fra billedsiderne uden automatisk skift:</p> <div style="margin-left:10px;"><table border="1"><tr><td>N&#230;ste</td> <td>n, RETUR</td></tr> <tr><td>Foreg&#229;ende</td> <td>p</td></tr> <tr><td>n x n sider</td> <td>u</td></tr> <tr><td>Film indholdssiden</td> <td>x</td></tr> <tr><td>K&#248;r</td> <td>r, MELLEMRUM</td></tr> <tr><td>Stop</td> <td>s, MELLEMRUM</td></tr> <tr><td>Kopier LAML reference til clipboard</td> <td>q</td></tr></table></div> <p>Bem&#230;rk at nogle af disse tastaturgenveje ogs&#229; vises, n&#229;r musen hviler over et link.</p> <p>Hvis du &#248;nsker at generere en LAML fotofremvisning kan du l&#230;se om dette p&#229; en separat <a href="http://www.cs.auc.dk/~normark/scheme/styles/xml-in-laml/photo-show/man/photo-show.html">manual side</a>. Hvis du &#248;nsker at vide mere om LAML og LAML software er du velkommen til at se p&#229; <a href="http://www.cs.auc.dk/~normark/laml/">LAML hjemmesiden</a>.</p> &nbsp; <p></p> <p>Kurt N&#248;rmark <br /> <a href="http://www.cs.auc.dk/~normark/">http://www.cs.auc.dk/~normark/</a> <br /> normark@cs.aau.dk</p></div></body></html>